results-media-harness_2_0_0-run/result-2026-01-05-22:51:11/wrk2_results_20260105_225117.txt
Running 30s test @ http://nginx-web-server:8080
  16 threads and 16 connections
  Thread calibration: mean lat.: 2.731ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 2.665ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 2.400ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 2.174ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 2.209ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 2.333ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 2.268ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 2.179ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 2.291ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 2.327ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 2.354ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 2.270ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 2.340ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 2.251ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 2.355ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 2.472ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     2.44ms    0.96ms  12.06ms   68.49%
    Req/Sec    52.73     52.42   111.00     78.70%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    2.49ms
 75.000%    3.03ms
 90.000%    3.55ms
 99.000%    4.91ms
 99.900%    6.85ms
 99.990%    9.86ms
 99.999%   12.06ms
100.000%   12.06ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.390     0.000000            1         1.00
       1.158     0.100000         1597         1.11
       1.553     0.200000         3197         1.25
       1.942     0.300000         4795         1.43
       2.255     0.400000         6395         1.67
       2.491     0.500000         7991         2.00
       2.599     0.550000         8804         2.22
       2.695     0.600000         9583         2.50
       2.797     0.650000        10390         2.86
       2.909     0.700000        11183         3.33
       3.029     0.750000        11984         4.00
       3.095     0.775000        12382         4.44
       3.159     0.800000        12779         5.00
       3.237     0.825000        13179         5.71
       3.325     0.850000        13580         6.67
       3.427     0.875000        13977         8.00
       3.489     0.887500        14186         8.89
       3.553     0.900000        14374        10.00
       3.637     0.912500        14575        11.43
       3.733     0.925000        14777        13.33
       3.845     0.937500        14975        16.00
       3.905     0.943750        15073        17.78
       3.979     0.950000        15173        20.00
       4.071     0.956250        15273        22.86
       4.163     0.962500        15373        26.67
       4.271     0.968750        15471        32.00
       4.339     0.971875        15523        35.56
       4.411     0.975000        15574        40.00
       4.479     0.978125        15623        45.71
       4.587     0.981250        15673        53.33
       4.675     0.984375        15721        64.00
       4.735     0.985938        15747        71.11
       4.791     0.987500        15773        80.00
       4.859     0.989062        15797        91.43
       4.967     0.990625        15822       106.67
       5.087     0.992188        15846       128.00
       5.167     0.992969        15858       142.22
       5.259     0.993750        15871       160.00
       5.355     0.994531        15883       182.86
       5.475     0.995313        15896       213.33
       5.611     0.996094        15909       256.00
       5.663     0.996484        15914       284.44
       5.795     0.996875        15921       320.00
       5.971     0.997266        15927       365.71
       6.111     0.997656        15933       426.67
       6.423     0.998047        15939       512.00
       6.507     0.998242        15943       568.89
       6.559     0.998437        15946       640.00
       6.671     0.998633        15949       731.43
       6.807     0.998828        15952       853.33
       6.863     0.999023        15955      1024.00
       6.875     0.999121        15956      1137.78
       7.183     0.999219        15958      1280.00
       7.523     0.999316        15960      1462.86
       7.887     0.999414        15961      1706.67
       8.067     0.999512        15963      2048.00
       8.067     0.999561        15963      2275.56
       8.351     0.999609        15964      2560.00
       8.479     0.999658        15965      2925.71
       9.103     0.999707        15966      3413.33
       9.239     0.999756        15967      4096.00
       9.239     0.999780        15967      4551.11
       9.239     0.999805        15967      5120.00
       9.863     0.999829        15968      5851.43
       9.863     0.999854        15968      6826.67
      10.439     0.999878        15969      8192.00
      10.439     0.999890        15969      9102.22
      10.439     0.999902        15969     10240.00
      10.439     0.999915        15969     11702.86
      10.439     0.999927        15969     13653.33
      12.063     0.999939        15970     16384.00
      12.063     1.000000        15970          inf
#[Mean    =        2.444, StdDeviation   =        0.956]
#[Max     =       12.056, Total count    =        15970]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  24002 requests in 29.97s, 7.92MB read
  Non-2xx or 3xx responses: 22479
Requests/sec:    800.82
Transfer/sec:    270.61KB

--- RESPONSE STATUS HISTOGRAM ---
Total requests: 24002
Total errors (4xx/5xx): 22479
Threads aggregated: 16

Status code distribution:
  200:     1523 (  6.35%) ███
  500:    22479 ( 93.65%) ██████████████████████████████████████████████

Histogram data written to: /wrktemp/results/response_histogram.json